average_user_flow.yml
config:
    phases:
        - duration: 1
          arrivalCount: 1
scenarios:
    - name: "average user"
      flow:
        - post:
            url: "/signup"
            body: "email=loadtest_{{ $randomString(32) }}%40localhost&password=test.....&password_repeat=test.....&clientLanguage=de_DE&clientOrigin=http%3A%2F%2Flocalhost%3A"
            headers:
                Content-Type: "application/x-www-form-urlencoded"
        - get:
            url: "/api/user/current/root"
            capture:
                json: "$.rootPlanningObjectId"
                as: "rootPlanningObjectId"
        # create project
        - post:
            url: "/api/planning-objects"
            json: 
                cas: null
                id: null
                isProject: true
                name: "Project1"
                note: ""
                position: 0
                progress: 0
                wdm: "d"
                userDefinedStart: "2016-03-08"
                userDefinedDuration: 1
                calculatedStart: null
                calculatedDuration: null
                parent: "{{ rootPlanningObjectId }}"
                childrenIds: []
                link: []
                acl: []
                roles: []
                relations: []
                insertAsLastChild: true
            capture:
              json: "$.id"
              as: "projectId"

        - think: 1

        # create summary
        - post:
            url: "/api/planning-objects"
            json:
                acl: []
                calculatedDuration: null
                calculatedStart: null
                cas: null
                childrenIds: []
                id: null
                insertAsLastChild: false
                isProject: false
                link: []
                name: "{{ $randomString(32) }}"
                note: "{{ $randomString(128) }}"
                parent: "{{ projectId }}"
                position: 0
                progress: 0
                relations: []
                roles: []
                userDefinedDuration: 1
                userDefinedStart: "2016-03-08"
                wdm: "d"
            capture:
                json: "$.id"
                as: "summaryId"

        - think: 1

        # create child 1
        - post:
            url: "/api/planning-objects"
            json:
                acl: []
                calculatedDuration: null
                calculatedStart: null
                cas: null
                childrenIds: []
                id: null
                insertAsLastChild: false
                isProject: false
                link: []
                name: "{{ $randomString(32) }}"
                note: "{{ $randomString(128) }}"
                parent: "{{ summaryId }}"
                position: 0
                progress: 0
                relations: []
                roles: []
                userDefinedDuration: 1
                userDefinedStart: "2016-03-08"
                wdm: "d"
            capture:
                json: "$.id"
                as: "child1Id"
        # create child 2
        - post:
            url: "/api/planning-objects"
            json:
                acl: []
                calculatedDuration: null
                calculatedStart: null
                cas: null
                childrenIds: []
                id: null
                insertAsLastChild: false
                isProject: false
                link: []
                name: "{{ $randomString(32) }}"
                note: "{{ $randomString(128) }}"
                parent: "{{ summaryId }}"
                position: 0
                progress: 0
                relations: []
                roles: []
                userDefinedDuration: 1
                userDefinedStart: "2016-03-08"
                wdm: "d"
            capture:
                json: "$.id"
                as: "child2Id"

        - think: 2

        # load children
        - get:
            url: "/api/planning-objects/{{ id }}/relations"

        - think: 1

        # link children
        - post:
            url: "/api/planning-objects/{{ child2Id }}/link"
            json:
                autolink: null
                autolinkCycle: false
                autolinkIgnoredInCycle: false
                source: "{{ child1Id }}"
                target: "{{ child2Id }}"
                type: "end-start"
        - patch:
            url: "/api/planning-objects/{{ child2Id }}/link/{{ child1Id }}/end-start"
            json:
                autolink: true

        - think: 1

        # modify duration of children 1
        - patch:
            url: "/api/planning-objects/{{ child1Id }}"
            json:
                userDefinedDuration: 10

        - think: 1

        # modify name of children 2
        - patch:
            url: "/api/planning-objects/{{ child2Id }}"
            json:
                name: "{{ $randomString(32) }}"

        - think: 2

        # multiplicate planning objects (result 768 pos)
        - post:
            url: "/api/planning-objects/duplicate"
            json:
              parentId: "{{ summaryId }}"
              poIds: ["{{ summaryId }}"]

        - think: 1

        - post:
            url: "/api/planning-objects/duplicate"
            json:
              parentId: "{{ summaryId }}"
              poIds: ["{{ summaryId }}"]

        - think: 1

        - post:
            url: "/api/planning-objects/duplicate"
            json:
              parentId: "{{ summaryId }}"
              poIds: ["{{ summaryId }}"]
    - name: test
      flow:
        - post:
            url: /signup
            headers:
              content-type: application/x-www-form-urlencoded
            body: 'email=loadtest_{{ $randomstring(32) }}%40localhost&password=random123&password_repeat=random123&clientlanguage=en_us&clientorigin=https%3a%2f%2frplan.com'
        - think: 1
        - get:
            url: /api/featureswitch
            headers: {}
        - get:
            url: /api/user/current/root
            headers: {}
            capture:
              json: "$.rootplanningobjectid"
              as: "rootplanningobjectid"
        - get:
            url: /statestorage/schedulemanager.workingset
            headers: {}
        - get:
            url: /api/user/current/root
            headers: {}
            capture:
              json: "$.rootplanningobjectid"
              as: "rootplanningobjectid"
        - get:
            url: /api/planning-objects/{{ rootplanningobjectid }}/relations?calculatevalues=false
            headers: {}
        - get:
            url: /api/user/current/root
            headers: {}
            capture:
              json: "$.rootplanningobjectid"
              as: "rootplanningobjectid"
        - think: 2
        - post:
            url: /api/planning-objects
            headers:
              content-type: application/json
            json:
              cas: null
              id: null
              isproject: true
              name: project
              note: ''
              position: 0
              progress: 0
              relations: []
              wdm: d
              userdefinedstart: '2016-03-08'
              userdefinedduration: 1
              calculatedstart: null
              calculatedduration: null
              parent: "{{ rootplanningobjectid }}"
              childrenids: []
              link: []
              acl: []
              roles: []
              insertaslastchild: true
            capture:
              json: "$.id"
              as: "projectid"
        - put:
            url: /statestorage/schedulemanager.workingset
            headers:
              content-type: application/json
            json:
              schedulemanager.workingset:
                - "{{ projectid }}"
        - post:
            url: /api/planning-objects
            headers:
              content-type: application/json
            json:
              cas: null
              id: null
              isproject: false
              name: '1'
              note: ''
              position: 0
              progress: 0
              relations: []
              wdm: d
              userdefinedstart: '2016-03-08'
              userdefinedduration: 1
              calculatedstart: null
              calculatedduration: null
              parent: "{{ projectid }}"
              childrenids: []
              link: []
              acl: []
              roles: []
              insertaslastchild: false
            capture:
              json: "$.id"
              as: "milestone1"
        - post:
            url: /api/planning-objects
            headers:
              content-type: application/json
            json:
              cas: null
              id: null
              isproject: false
              name: '2'
              note: ''
              position: 0
              progress: 0
              relations: []
              wdm: d
              userdefinedstart: '2016-03-08'
              userdefinedduration: 1
              calculatedstart: null
              calculatedduration: null
              parent: "{{ projectid }}"
              childrenids: []
              link: []
              acl: []
              roles: []
              insertaslastchild: true
            capture:
              json: "$.id"
              as: "milestone2"
        - post:
            url: /api/planning-objects
            headers:
              content-type: application/json
            json:
              cas: null
              id: null
              isproject: false
              name: '3'
              note: ''
              position: 0
              progress: 0
              relations: []
              wdm: d
              userdefinedstart: '2016-03-08'
              userdefinedduration: 1
              calculatedstart: null
              calculatedduration: null
              parent: "{{ projectid }}"
              childrenids: []
              link: []
              acl: []
              roles: []
              insertaslastchild: true
            capture:
              json: "$.id"
              as: "milestone3"
        - post:
            url: /api/planning-objects
            headers:
              content-type: application/json
            json:
              cas: null
              id: null
              isproject: false
              name: '4'
              note: ''
              position: 0
              progress: 0
              relations: []
              wdm: d
              userdefinedstart: '2016-03-08'
              userdefinedduration: 1
              calculatedstart: null
              calculatedduration: null
              parent: "{{ projectid }}"
              childrenids: []
              link: []
              acl: []
              roles: []
              insertaslastchild: true
            capture:
              json: "$.id"
              as: "milestone4"
        - think: 2
        - post:
            url: /api/planning-objects
            headers:
              content-type: application/json
            json:
              cas: null
              id: null
              isproject: false
              name: '5'
              note: ''
              position: 0
              progress: 0
              relations: []
              wdm: d
              userdefinedstart: '2016-03-08'
              userdefinedduration: 1
              calculatedstart: null
              calculatedduration: null
              parent: "{{ projectid }}"
              childrenids: []
              link: []
              acl: []
              roles: []
              insertaslastchild: true
            capture:
              json: "$.id"
              as: "milestone5"
        - patch:
            url: /api/planning-objects/{{ milestone1 }}
            headers:
              content-type: application/json
            json:
              userdefinedduration: 0
        - patch:
            url: /api/planning-objects/{{ milestone2 }}
            headers:
              content-type: application/json
            json:
              userdefinedduration: 0
        - patch:
            url: /api/planning-objects/{{ milestone3 }}
            headers:
              content-type: application/json
            json:
              userdefinedduration: 0
        - patch:
            url: /api/planning-objects/{{ milestone4 }}
            headers:
              content-type: application/json
            json:
              userdefinedduration: 0
        - patch:
            url: /api/planning-objects/{{ milestone5 }}
            headers:
              content-type: application/json
            json:
              userdefinedduration: 0
        - patch:
            url: /api/planning-objects/{{ milestone2 }}
            headers:
              content-type: application/json
            json:
              userdefinedstart: '2016-03-16'
        - patch:
            url: /api/planning-objects/{{ milestone3 }}
            headers:
              content-type: application/json
            json:
              userdefinedstart: '2016-03-21'
        - patch:
            url: /api/planning-objects/{{ milestone4 }}
            headers:
              content-type: application/json
            json:
              userdefinedstart: '2016-03-23'
        - patch:
            url: /api/planning-objects/{{ milestone5 }}
            headers:
              content-type: application/json
            json:
              userdefinedstart: '2016-03-29'
        - patch:
            url: /api/planning-objects/{{ projectid }}
            headers:
              content-type: application/json
            json:
              userdefinedduration: 23
        - think: 2
        - post:
            url: /api/planning-objects
            headers:
              content-type: application/json
            json:
              cas: null
              id: null
              isproject: false
              name: a
              note: ''
              position: 0
              progress: 0
              relations: []
              wdm: d
              userdefinedstart: '2016-03-29'
              userdefinedduration: 1
              calculatedstart: null
              calculatedduration: null
              parent: "{{ projectid }}"
              childrenids: []
              link: []
              acl: []
              roles: []
              insertaslastchild: true
            capture:
              json: "$.id"
              as: "poa"
        - post:
            url: /api/planning-objects
            headers:
              content-type: application/json
            json:
              cas: null
              id: null
              isproject: false
              name: b
              note: ''
              position: 0
              progress: 0
              relations: []
              wdm: d
              userdefinedstart: '2016-03-29'
              userdefinedduration: 1
              calculatedstart: null
              calculatedduration: null
              parent: "{{ projectid }}"
              childrenids: []
              link: []
              acl: []
              roles: []
              insertaslastchild: true
            capture:
              json: "$.id"
              as: "pob"
        - post:
            url: /api/planning-objects
            headers:
              content-type: application/json
            json:
              cas: null
              id: null
              isproject: false
              name: c
              note: ''
              position: 0
              progress: 0
              relations: []
              wdm: d
              userdefinedstart: '2016-03-29'
              userdefinedduration: 1
              calculatedstart: null
              calculatedduration: null
              parent: "{{ projectid }}"
              childrenids: []
              link: []
              acl: []
              roles: []
              insertaslastchild: true
            capture:
              json: "$.id"
              as: "poc"
        - think: 2
        - patch:
            url: /api/planning-objects/{{ poa }}
            headers:
              content-type: application/json
            json:
              userdefinedduration: 5
        - patch:
            url: /api/planning-objects/{{ pob }}
            headers:
              content-type: application/json
            json:
              userdefinedduration: 10
        - patch:
            url: /api/planning-objects/{{ poc }}
            headers:
              content-type: application/json
            json:
              userdefinedduration: 3
        - think: 2
        - post:
            url: /api/planning-objects/links
            headers:
              content-type: application/json
            json:
              - source: "{{ poa }}"
                target: "{{ pob }}"
                type: end-start
                autolink: true
                autolinkcycle: false
                autolinkignoredincycle: false
              - source: "{{ pob }}"
                target: "{{ poc }}"
                type: end-start
                autolink: true
                autolinkcycle: false
                autolinkignoredincycle: false
        - post:
            url: /api/planning-objects/{{ poa }}/link
            headers:
              content-type: application/json
            json:
              source: "{{ milestone2 }}"
              target: "{{ poa }}"
              type: end-start
              autolink: null
              autolinkcycle: false
              autolinkignoredincycle: false
        - patch:
            url: /api/planning-objects/{{ poa }}/link/{{ milestone2 }}/end-start
            headers:
              content-type: application/json
            json:
              autolink: true
        - post:
            url: /api/planning-objects
            headers:
              content-type: application/json
            json:
              cas: null
              id: null
              isproject: false
              name: '1'
              note: ''
              position: 0
              progress: 0
              relations: []
              wdm: d
              userdefinedstart: '2016-03-29'
              userdefinedduration: 1
              calculatedstart: null
              calculatedduration: null
              parent: "{{ poc }}"
              childrenids: []
              link: []
              acl: []
              roles: []
              insertaslastchild: false
            capture:
              json: "$.id"
              as: "child1"
        - post:
            url: /api/planning-objects
            headers:
              content-type: application/json
            json:
              cas: null
              id: null
              isproject: false
              name: '2'
              note: ''
              position: 0
              progress: 0
              relations: []
              wdm: d
              userdefinedstart: '2016-03-29'
              userdefinedduration: 1
              calculatedstart: null
              calculatedduration: null
              parent: "{{ poc }}"
              childrenids: []
              link: []
              acl: []
              roles: []
              insertaslastchild: true
            capture:
              json: "$.id"
              as: "child2"
        - post:
            url: /api/planning-objects
            headers:
              content-type: application/json
            json:
              cas: null
              id: null
              isproject: false
              name: '3'
              note: ''
              position: 0
              progress: 0
              relations: []
              wdm: d
              userdefinedstart: '2016-03-29'
              userdefinedduration: 1
              calculatedstart: null
              calculatedduration: null
              parent: "{{ poc }}"
              childrenids: []
              link: []
              acl: []
              roles: []
              insertaslastchild: true
        - post:
            url: /api/planning-objects
            headers:
              content-type: application/json
            json:
              cas: null
              id: null
              isproject: false
              name: '4'
              note: ''
              position: 0
              progress: 0
              relations: []
              wdm: d
              userdefinedstart: '2016-03-29'
              userdefinedduration: 1
              calculatedstart: null
              calculatedduration: null
              parent: "{{ poc }}"
              childrenids: []
              link: []
              acl: []
              roles: []
              insertaslastchild: true
        - post:
            url: /api/planning-objects/duplicate
            headers:
              content-type: application/json
            json:
              poids:
                - "{{ child1 }}"
              parentid: "{{ child2 }}"
            capture:
              json: "$.originalduplicateidmap.{{ child1 }}"
              as: "copy_child1"
        - post:
            url: /api/planning-objects/duplicate
            headers:
              content-type: application/json
            json:
              poids:
                - "{{ child2 }}"
              parentid: "{{ copy_child1 }}"
            capture:
              json: "$.originalduplicateidmap.{{ copy_child1 }}"
              as: "copy_copy_child1"
        - get:
            url: /schedulemanager/object/{{ copy_copy_child1 }}
            headers: {}
        - think: 2
        - get:
            url: /api/featureswitch
            headers: {}
        - get:
            url: /api/user/current/root
            headers: {}
        - get:
            url: /api/planning-objects/{{ projectid }}
            headers: {}
        - put:
            url: /statestorage/schedulemanager.workingset
            headers:
              content-type: application/json
            json:
              schedulemanager.workingset:
                - "{{ projectid }}"
        - get:
            url: /api/planning-objects/{{ copy_copy_child1 }}/path-in-working-set?rootelementids={{ projectid }}
            headers: {}